{
  "translation": "En",
  "header": {
    "aboutMe": "Sobre mi",
    "skills": "Habilidades",
    "projects": "Proyectos",
    "experience": "Experiencia"
  },
  "profession": "Desarrollador FullStack",
  "resume": "Hoja de vida",
  "aboutMe": {
    "title": "Sobre mi",
    "description": {
      "one": "Soy un apasionado desarrollador FullStack con más de 3 años de experiencia en la creación de sitios web desde cero y en la mejora del diseño y la funcionalidad. Con sólidos conocimientos técnicos en herramientas como React, Redux, Angular, TypeScript, y en la gestión de grandes bases de datos como PostgreSQL y SQLServer, también tengo experiencia en el desarrollo Backend con Django y C#.",
      "two": "Mis habilidades van más allá de la programación; soy una persona comprometida y disciplinada que siempre busca alcanzar los mejores resultados posibles. Soy entusiasta con mi trabajo y consistente en lograr los objetivos establecidos.",
      "three": "Si estás interesado en conocer más sobre mi trabajo, no dudes en ponerte en contacto. ¡Me encantaría mostrarte lo que puedo hacer por tu empresa o proyecto!"
    },
    "basicInformation": {
      "title": "Información Basica",
      "language": "Español, Ingles",
      "age": "Edad",
      "email": "Correo Electrónico",
      "cellphone": "Celular",
      "languageTitle": "Idiomas"
    }
  },
  "skills": "Habilidades Profesionales",
  "projects": {
    "title": "Proyectos",
    "up_task":"Manejador de tareas: Aplicación desarrollada con Express, MongoDB y React, utilizando Zustand, React Query, useClient, React Router y JWT para autenticación segura. Permite la creación y organización de tareas, asignación de responsables y gestión de estados de seguimiento. Los usuarios pueden vincularse y desvincularse de proyectos, y cada miembro del equipo tiene acceso a una cuenta propia, lo que facilita la visualización de las tareas asignadas y el progreso de los proyectos.",
    "cocktail_app": "Proyecto Buscador de Recetas de Cócteles: Aplicación que se conecta a una API para obtener recetas según el ingrediente y la categoría ingresados. Desarrollada en React, utiliza React Router, Zustand para la gestión de estados, Zod para la validación de datos, TypeScript, y guarda las búsquedas en localStorage.",
    "cripto_app": "Proyecto Cotizador de Criptomonedas: Aplicación en React que utiliza una API para obtener información sobre 4 tipos de monedas y la criptomoneda seleccionada. Implementa herramientas como Zustand, Zod y useEffect para la gestión de estados y validación de datos.",
    "pacients_app": "Proyecto de Agenda para Pacientes Veterinarios: Aplicación que permite ingresar información del propietario, correo electrónico y síntomas del paciente. La aplicación crea una tarjeta con los datos del paciente para su seguimiento. Desarrollada en React, utiliza hooks, Tailwind, Toastify para las notificaciones, y React Hook Form.",
    "spend_app": "Proyecto de control de gastos está diseñado para gestionar de manera eficiente el dinero disponible. Permite registrar gastos diarios de forma sencilla y emite alertas cuando los gastos superan el monto disponible. Los usuarios pueden seleccionar el tipo de gasto al registrarlo y aplicar filtros para identificar los gastos más significativos. El proyecto está desarrollado con React y utiliza funcionalidades avanzadas como Reducer, useContext, useMemo, localStorage y TypeScript para ofrecer una experiencia de usuario robusta y optimizada.",
    "gift_app": "Este proyecto desarrollado en Angular permite realizar búsquedas de GIFs a través de una API. Además, guarda el historial de las últimas 10 búsquedas realizadas, facilitando el acceso rápido a búsquedas anteriores y mejorando la experiencia del usuario.",
    "backend_django": "Este proyecto, realizado como práctica, está enfocado en la integración de una base de datos y la dockerización de un proyecto en Django. Permite realizar un CRUD para gestionar personas, incluyendo la creación de perfiles con diferentes hobbies. Toda la implementación y configuración están documentadas en el repositorio.",
    "info_link":"Puedes visitar la pagina en el siguiente",
    "code_repo": "Código del repositorio"
  },
  "experiences": {
    "title": "Experiencia",
    "knowledgeSkills":"Conocimientos Y Habilidades",
    "hdi": {
      "company":"HDI Seguros Colombia",
      "jobPosition": "Ingeniero de desarrollo",
      "durationEmployment":"Diciembre 2023 - Actualidad",
      "achievements": {
        "one": " Realizar mantenimientos y desarrollos a páginas existentes de la compañía.",
        "two": "Creación de servicios API REST para consumo front-end, incluyendo pruebas, ejecución y documentación.",
        "three": "Creación de procedimientos almacenados en la base de datos para su consumo desde el backend.",
        "four": "Creación de proyectos nuevos en front utilizando Angular.",
        "five": "Ejecución de requerimientos solicitados por el área de QA."
      },
      "skills":"C# | Angular Js | .Net Framework | ASP.Net | Visual Basic | Django"
    },
    "artemisa": {
      "jobPosition": "Analista de desarrollo",
      "company":"Artemisa TECH SAS",
      "durationEmployment":"Junio 2023 - Diciembre 2023",
      "achievements": {
        "one": "Desarrollo de paginas web según los mockups proporcionados por el área funcional.",
        "two": "Creación de servicios API REST para consumo front-end, incluyendo pruebas, ejecución y documentación.",
        "three": "Creación de procedimientos almacenados en la base de datos para su consumo desde el backend.",
        "four": "Atención a los diferentes requerimientos funcionales solicitados por el área funcional o de calidad."
      },
      "skills":"Microsoft SQL Server | C# | Angular Js | Scrum | Sonar"
    },
    "grupoMok": {
      "company":"Grupo Mok",
      "positions": [
        {
          "jobPosition": "Desarrollador Semi-senior Full Stack",
          "durationEmployment":"Abril 2022 – Julio 2022",
          "achievements": {
            "one": " Desarrollo en diferentes lenguajes relacionados con bases de datos, modificando vistas y entregando el 60% del desarrollo al equipo funcional para posteriores mejoras.",
            "two": "Dirección de un equipo de 3 personas para corregir y entregar las novedades solicitadas por el área funcional, validando el cumplimiento de los puntos solicitados según el modelo de negocio de la empresa.",
            "three": "Optimización del 70% del código para que sea reutilizable mediante el análisis y corrección del aplicativo en React."
          }
        },
        {
          "jobPositionTwo": "Analista de desarrollo 2",
          "durationEmploymentTwo":"Enero 2022 - Abril 2022",
          "achievementsTwo": {
            "one": "Contribuí reduciendo en un 70% los errores detectados por el cliente al modificar las vistas y funciones que afectan la interacción del programa React con la base de datos.",
            "two": "Abordé las quejas de los usuarios respecto a datos incorrectos mediante la corrección de funciones en el Backend, garantizando el registro preciso de la información. "
          }
        },
        {
          "jobPositionThree": "Analista de desarrollo 1",
          "durationEmploymentThree":"Diciembre 2020 - Diciembre 2021",
          "achievementsThree": {
            "one": "Dirigí la reducción en un 90% de las tareas manuales al desarrollar un módulo para la carga masiva de documentos en Excel, con validaciones realizadas tanto por el equipo Frontend como el Backend. ",
            "two": "Desarrollé un formato en PDF para descargar un resumen de siniestros conciliados entre cliente y proveedor, facilitando la firma de un acta y su posterior carga al sistema para realizar conciliaciones de manera masiva"
          }
        }
      ],
      "skills":"GitLab | Reducer | Java | Scrum | React | Postgresql | Django"
    }
  }
}

